In [2]:
import numpy as np
import pandas as pd

In [3]:
s1 = pd.Series([0.25, 0.5, 0.75, 1.0])
s1

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [5]:
print(s1.values)
print(s1.index)

[0.25 0.5  0.75 1.  ]
RangeIndex(start=0, stop=4, step=1)

In [23]:
s1[0]

0.25

In [10]:
s1[2:]

2    0.75
3    1.00
dtype: float64

In [12]:
s2 = pd.Series([0.25, 0.5, 0.75, 1.0],
              index=['a', 'b', 'c', 'd'])
s2

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [13]:
s2['a']

0.25

In [24]:
s2['c':'d']

c    0.75
d    1.00
dtype: float64

In [26]:
s1 = pd.Series([4, 5, 6])
s1.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
s2 = pd.Series({100: 1, 200: 3, 400:5})
s2

100    1
200    3
400    5
dtype: int64

In [30]:
s2.index

Int64Index([100, 200, 400], dtype='int64')

In [33]:
s1.values

array([4, 5, 6], dtype=int64)

In [34]:
s2.values

array([1, 3, 5], dtype=int64)

In [37]:
df = pd.DataFrame(np.ones((4,2)))
df

     0    1
0  1.0  1.0
1  1.0  1.0
2  1.0  1.0
3  1.0  1.0

In [38]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [41]:
s1 = pd.Series([0.25, 0.5, 0.75, 1.0])
s2 = pd.Series([0.25, 0.5, 0.75, 1.0],
              index=['a', 'b', 'c', 'd'])

In [44]:
s2.index = [0, 1, 2, 3]
df2 = pd.DataFrame({"One": s1, "Two": s2})
df2

    One   Two
0  0.25  0.25
1  0.50  0.50
2  0.75  0.75
3  1.00  1.00

In [46]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [48]:
df2.columns

Index(['One', 'Two'], dtype='object')

In [51]:
df3 = pd.DataFrame(np.random.randint(0, 100, size=(4,2)),
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df3

   one  two
a   23   27
b   53    5
c   80   82
d   44   41

In [58]:
df3['three'] = np.arange(4)

In [59]:
df3

   one  two  three
a   23   27      0
b   53    5      1
c   80   82      2
d   44   41      3

In [60]:
df3.pop('three')

a    0
b    1
c    2
d    3
Name: three, dtype: int32

In [62]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [64]:
print(ind[1])
print(ind[::2])

3
Int64Index([2, 5, 11], dtype='int64')

In [66]:
s3 = pd.Series(['one', 'two', 'three', 'four', 'five'],
              index=ind)
s3

2       one
3       two
5     three
7      four
11     five
dtype: object

In [69]:
s4 = pd.Series(['cat', 'dog', 'fish', 'bird', 'tiger'],
              index=ind)
s4

2       cat
3       dog
5      fish
7      bird
11    tiger
dtype: object

In [84]:
df4 = pd.DataFrame({"Numbers": s3, "Animals": s4})

In [73]:
s1.index = ['a', 'b', 'c', 'd']
s1

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [79]:
s1.loc['a':'c':2]

a    0.25
c    0.75
dtype: float64

In [80]:
s1.iloc[::-1]

d    1.00
c    0.75
b    0.50
a    0.25
dtype: float64

In [82]:
s1['b']

0.5

In [86]:
df4

   Numbers Animals
2      one     cat
3      two     dog
5    three    fish
7     four    bird
11    five   tiger

In [88]:
df4['Numbers']

2       one
3       two
5     three
7      four
11     five
Name: Numbers, dtype: object

In [90]:
df4.loc[5]

Numbers    three
Animals     fish
Name: 5, dtype: object

In [92]:
df4.iloc[2]

Numbers    three
Animals     fish
Name: 5, dtype: object

In [94]:
df4[:2]

  Numbers Animals
2     one     cat
3     two     dog

In [97]:
df4[df4['Animals'] == 'tiger']

   Numbers Animals
11    five   tiger